#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vercel_env.students_api_url_env will be created
  + resource "vercel_env" "students_api_url_env" {
      + created_at = (known after apply)
      + id         = (known after apply)
      + key        = "api_base_url"
      + project_id = (known after apply)
      + target     = [
          + "production",
          + "preview",
          + "development",
        ]
      + type       = "plain"
      + updated_at = (known after apply)
      + value      = "https://api.wbk.so-gineers.com"
    }

  # vercel_env.teachers_api_url_env will be created
  + resource "vercel_env" "teachers_api_url_env" {
      + created_at = (known after apply)
      + id         = (known after apply)
      + key        = "api_base_url"
      + project_id = (known after apply)
      + target     = [
          + "production",
          + "preview",
          + "development",
        ]
      + type       = "plain"
      + updated_at = (known after apply)
      + value      = "https://api.wbk.so-gineers.com"
    }

  # vercel_project.students_app will be created
  + resource "vercel_project" "students_app" {
      + account_id                 = (known after apply)
      + alias                      = (known after apply)
      + created_at                 = (known after apply)
      + framework                  = "nextjs"
      + id                         = (known after apply)
      + name                       = "students"
      + node_version               = (known after apply)
      + root_directory             = "./frontend/apps/students"
      + serverless_function_region = (known after apply)
      + updated_at                 = (known after apply)

      + git_repository {
          + repo = "so-giners/workbook"
          + type = "github"
        }
    }

  # vercel_project.teachers_app will be created
  + resource "vercel_project" "teachers_app" {
      + account_id                 = (known after apply)
      + alias                      = (known after apply)
      + created_at                 = (known after apply)
      + framework                  = "nextjs"
      + id                         = (known after apply)
      + name                       = "teachers"
      + node_version               = (known after apply)
      + root_directory             = "./frontend/apps/teachers"
      + serverless_function_region = (known after apply)
      + updated_at                 = (known after apply)

      + git_repository {
          + repo = "so-gineers/workbook"
          + type = "github"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @papapathe, Action: `pull_request`, Working Directory: ``, Workflow: `Vercel`*